app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @products = Product.all

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "New Product"], ["description", "this is a v good thing"], ["price", 2], ["created_at", "2016-02-23 13:37:45.171894"], ["updated_at", "2016-02-23 13:37:45.171894"]]
---
  def create
    @product = Product.create(product_params)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_post
    @product = Product.find(params[:id])